// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Console.WriteLine("введите число");
// int number1=Convert.ToInt32 (Console.ReadLine());

// Console.WriteLine("введите число");
// int number2=Convert.ToInt32 (Console.ReadLine());

// if (number1 > number2);
// {
//     Console.WriteLine (number1);
// }

// if
//  (number2 > number1)
// {
//     Console.WriteLine (number2);
// };

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

Console.WriteLine("введите число");
int number1 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("введите число");
int number2 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("введите число");
int number3 = Convert.ToInt32(Console.ReadLine());

if(number1>number2);
    if(number1>number3)
    {
        Console.WriteLine( "максимальное число=  number1");
    }

    else
    {
        Console.WriteLine("максимальное число = number3");
    }

if (number2 > number3)
{
    Console.WriteLine ("максимальное число = number2");
    }

    

else { Console.WriteLine("максимальное число = number3");

};
