// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.WriteLine("введите число");
int number1=Convert.ToInt32 (Console.ReadLine());

Console.WriteLine("введите число");
int number2=Convert.ToInt32 (Console.ReadLine());

if (number1 > number2);
{
    Console.WriteLine (number1);
}

if
 (number2 > number1)
{
    Console.WriteLine (number2);
};